<?php require_once('php/_entertainment.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title><?php echo GetBlogTitle(20141016, true, false); ?></title>
<meta name="description" content="在Qualcomm同意现金收购CSR和中国国航(SH601111)罕见涨停的幸运日总结2年多来自己谨小慎微的A股市场大型国有股买卖获利方案。">
<?php EchoInsideHead(); ?>
<link href="../../../common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _LayoutTopLeft(); ?>

<div>
<h1><?php echo GetBlogTitle(20141016, true, false); ?></h1>
<p>2014年10月16日
<br />昨天是我的幸运日。Qualcomm同意现金收购<a href="20090219cn.php">CSR</a>的新闻让我这唯一的英国股票上涨了30%，而<?php EchoMyStockLink('SH601111', '中国国航'); ?>这只目前我唯一重仓的A股，在昨天拉了个涨停。
<br />我从2000年开始在美国市场上买卖股票，一直都是一个失败的投资。我总是在股票刚开始赚钱的时候就很快卖掉然后看它一路继续往上涨，而会把严重亏损的股票一直持有很多年。
今年6月<b>自愿</b>放弃美国绿卡后，因为没有了交税的心理负担，我一直在考虑卖掉最近几年上涨了很多的CSR股票。但是过去的经历让我总是觉得这很可能又会是另外一个错误的大决定，最后感谢Qualcomm替我做出了选择。
<br />2012年我开了A股账户。跟美国单一笔的交易费用不同，中国的券商按照交易金额比例收费。比如我开户的中银国际收0.075%，最低5块。对我来说这是个好的开始，从此我改变了交易风格，停止大笔交易。
<br />2000年的时候我有一阵子天天都疯狂买进卖出。结果不光赔了钱，第2年报税的时候又被折磨了一遍，一条条的手工输入每个卖出记录。后来我就学会了更加耐心的交易。美国市场上我可以下个单然后3个月不去管它，不过国内只能当天有效，所以我现在都是每天刚过午夜后下单，白天交易时段不再更改。
<br />因为这么多年来都没有培养成功我的止损习惯，我决定只操作A股的大型国企股票，这样市场不好的时候我一样可以安心持有。 
<br />希望能带来平均每年10%的收益，但愿未来能够成功。  
<br /><font color=gray>当你为朋友立传时，一定要做得像你在为他报仇雪恨那样。 -- 福楼拜的鹦鹉</font>
<?php echo ImgPortfolio20141016(); ?>
<br /><font color=gray>Just like I'd never gone, I knew the song. -- La Isla Bonita</font>
</p>

<h3><a name="2014">2014</a>总结</h3>
<p>2015年1月1日
<br />2014年买入47笔，卖出85笔，总交易132笔。总交易金额大约130万。5月持仓最高约48万，年末持仓最低约21万。全年账面盈利增加约17万。按照年初计划的100万资金投入，算上国债逆回购和利息收入后全年收益率大约21%。 
<br />2015年继续计划100万资金投入，交易规则不变。
</p>

<h3><a name="2015">2015</a>总结</h3>
<p>2016年1月3日
<br />2015年总交易金额大约600万，比<a href="#2014">2014</a>年多了4倍。8月持仓最高约65万，6月持仓最低约17万，总体平均持仓比2014年略高。全年账面盈利增加约6万，按照计划的100万资金投入，算上逆回购和利息收入后全年收益率大约9%，大幅低于2014年。
<br />大约50%的交易金额是6到8月分级A贡献的，今年的6万纯盈利也基本上来自于这段时间300万的分级A交易。大家都说7月8日那种分级A集体跌停的机会百年难遇，看来我这辈子再也碰不到了。
<br />上证指数站上5000点那天后跟老孙的几个朋友吃饭，席间谈论的当然都是必破6124点的股票市场。老孙听说我大部分人民币都放在银行买收益率5%的理财产品后，大力推荐我购买当时折价已经在20%以上的分级A基金。
<br />基于对老孙学习精神的信任，我赶紧恶补了一下。发现折价20%以上的分级A的确是个好东西，收益率比银行理财高，风险却比银行理财低。显然过去三年多以来我低估了人民币的无风险收益。
<br />考虑到分级A操作会比我的大型国企股票要频繁得多，我在国联证券网上开了个0.025%，最低5块交易费用的新帐户。本来是想联系中银国际降低佣金的，无奈股市太火爆，电话永远打不进去，根本联系不上。 
<br /><font color=gray>中间是勤奋好学而且乐于分享的老孙。</font>
<br /><img src=../../groupphoto/customer/laosun.jpg alt="Li Jing, Sun Yanhong and me in central park, NYC." />
<br />炒股的好处不只限于分级A。其实这一年多以来给我印象最深的是在雪球上看<?php EchoXueqiuId('3037882447', '云蒙'); ?>来回在港股和A股之间买卖招商银行的股票，哪边低就持有哪个，用不到2百万的本金，1年交易了几个亿，稳稳赚了几百万。这种锚定一个标的来回交易套利的模式值得学习。 
<br />Qualcomm收购CSR的现金在8月下旬到账后，由于我的美股交易依旧毫无章法，我其实有点发愁怎么处理这笔钱。最省心的就是直接都买成Qualcomm股票，然后接着放着不去管它。
反复考虑后我还是决定效仿套利。锚定标普油气开采指数^SPSIOP的2个基金，用我低交易费用的国联证券账户, 在A股的华宝油气和美股的XOP之间来回交易。
<br />其实我从2014年底就开始用当时手头不多的美元尝试抄底原油和相关股票的ETF，碰到的还是老问题，抄底的时候总抄在半山腰，涨一点就忍不住卖光了。希望通过套利交易能够克服我的持仓恐惧症。
<br />华宝油气虽然跟踪的是美国的页岩油气公司股票，但是它喜欢跟A股涨跌，而且A股涨的时候往往会溢价，而跌的时候总会折价。开始我一直觉得是A股钱多人傻，买卖的人根本不知道自己买卖的是什么标的。但是后来我进入了第二层境界考虑这个问题，由于A股的涨跌直接影响大宗商品的价格，华宝油气跟A股短期走势一致也是可以理解的。  
后来看到老孙在微信上炫耀他读高中的儿子暑假2个月用18万本金在分级基金上套利总共获利2.5万人民币。我于是进入了<font color=teal>看山还是山 看水还是水</font>的第三层境界：A股市场钱多人傻，可能的确是套利交易者生存的好地方。
<br />这一年大约40%的交易金额来自华宝油气和XOP的套利交易，体现在全年收益上是华宝油气亏损5万。不过经过2015年5个月的摸索，又写了<a href="20150818cn.php">华宝油气净值</a>估算工具，感觉自己终于找到了阿里巴巴山洞的开门密码。记录一下目前仓位，以便日后比较。
<br /><img src=../photo/20160101.jpg alt="Screen shot of my 2015 XOP and SZ162411 arbitrage data" />
<br />剩下10%的交易金额主要是我的大型国企中国国航、中国石化、中国联通和中国银行等交易，受益于上证指数今年10%的上涨，盈利5万左右。
<br />2016年继续100万的投入，主要用于<a href="../../res/sz162411cn.php">华宝油气</a>和XOP的套利交易。继续加大交易量，增加套利效率。同时逐步放弃中国国航和中国联通等比H股贵太多的A股的交易。
<br /><font color=gray>This could be Heaven or this could be Hell -- California Hotel</font>
</p>

<h3>留得青山在 不怕没柴烧 - <a name="2016">2016</a>总结</h3>
<p>2017年1月1日
<br />2016年几乎每天都在交易，交易金额多得我在5月份就放弃统计了。高频交易的结局却很悲惨。全年人民币赚了228321.46，美元亏了37815.39，总体亏损人民币34003.89。全年收益率大约-2%。
<br />整个2016年只有2个交易日总体持仓是赚钱的。由于持续的亏钱导致心理崩溃好几次，而在每次心理崩溃后都会暴饮暴食，之前3年没有发作痛风在2016年发作了好几次，让人生更加黑暗无比。
<br />年初的时候美油CL跌破40美元大举买入3倍杠杆的UWTI抄底，一路接飞刀接到30美元弹尽粮绝。眼看它跌到26，反弹到33，换月升水近2美元后再次跌回26，当时觉得美元要赔光了。吓破胆子后，再次反弹到33割肉，留下31111.66美元的亏损。然后的剧情是CL一路上涨，最高差不多到了55美元。而我是再也不敢交易3倍杠杆的东西了。 
<br />上半年美股跌得比较厉害，原来用<?php EchoMyStockLink('SH'); ?>做空美股对冲华宝油气和XOP的多仓作用太小，美股反弹后就开始了<?php EchoMyStockLink('VXX'); ?>的自杀之旅。
一开始运气好，没2个月就碰上了英国脱欧，VXX一度获利6000多美元。然后美股一路新高，到了11月临近美国总体竞选前实在崩溃了，不仅把之前赚了赔了回去，割肉后还留下大约8000美元亏空。 
Trump当选后美股又开始涨，不死心继续买VXX，再次崩溃，12月30号最后一个交易日再次彻底割肉，留下总共16063.35美元的亏损。发誓赌咒再不碰它了，回归SH空美股对冲。
<br />写<a href="#2015">2015</a>总结时觉得最靠谱的华宝油气和XOP的套利交易，全年下来也讽刺得很。几乎每天都在交易，目前0持仓。看上去是人民币赚了144989.38，美元赚了12026.69，残酷的现实情况是，如果在2015年结束的仓位上完全不交易，则会赚228480人民币和17920美元。
套利一整年收获无数多巴胺，却比持股不动少赚35%的真金白银。
<br /><img src=../photo/20170101.jpg alt="Screen shot of woody's 2016 XOP and SZ162411 arbitrage data" />
<br />伴随套利交易而来的好处是交易费用下降了，A股新开了万分之2佣金的华泰证券账户。最近客户经理还把我的基金交易佣金又调低到了万分之一，而且它家基金交易还没有最低5块的限制。美股跟随云蒙新开了IB盈透账户，每股交易费用0.005美元，最低1美元。相当于最少收200股的交易费用。
同时总交易金额迅速增加，多到我不胜其烦，干脆结束了原来用Excel统计交易量的栏目。花在交易上的时间也是急剧增加，已经让我相当怀疑这么做有没有必要了。还是要尽可能简化交易模式，避免盯盘。另外要赶快把盈透的API搞起来，自动交易美股部分。 
<br />全年唯一得意之处，是在美股中石化价格高于A股中国石化的阶段空SNP多<?php EchoMyStockLink('SH600028'); ?>。套利赚了点小钱不说，SH600028的门票打中了一个新股<?php EchoMyStockLink('SH603060'); ?>，赚了37219.01人民币。
<br />2017年继续打新，继续华宝油气和XOP套利，同时看能不能多发掘其它类似套利途径。坚决不再交易美股期货相关的ETF和杠杆ETF。 
</p>

<h3>采菊东篱下 悠然见南山 - <a name="2017">2017</a>总结</h3>
<p>2017年12月30日
<br />说多了都是泪，先上图记录一下。
<br /><img src=../photo/20180102.jpg alt="Screen shot of woody's 2017 stock profit data" />
<br />在跟寒号鸟一样喊了好几年<font color=gray>同是天涯沦落人 走投无路来炒股</font>后，2017年算是我最接近全职投资的一年。全职不光意味着跟前些年一样整天没有别的鸟事可做，还意味着今年所有的钱都放到股市中来赌博了。虽然操了卖粉的心，却连白菜钱都没有赚到。
美元人民币一起本金大约350万人民币，一年下来只有16万人民币的利润，不到5%的收益率，放银行闭着眼睛买理财一样能拿这么多钱。 
<br />年初在<?php EchoXueqiuId('3724438413', '爱吐槽的骑姐'); ?>的感召下弄了几个HA价格差不多的A股门票打新，很快就跟去年一样人品爆棚中了一个新股<?php EchoMyStockLink('SH603089'); ?>赚了3万多。
紧接着所有的门票就在我的持股恐惧症下卖飞了，从此跟A股成了路人，愧对从去年开始一直督促我打新的人生导师<?php EchoXueqiuId('5421738073', 'thanous'); ?>。 
<br />在鼓吹XOP和华宝油气跨市场套利2年多后，今年终于靠<?php EchoXueqiuId('6706948861', 'zzzzv'); ?>的不懈教诲克服了唐氏综合症的天生迟钝，在6月份开始了申购套利，9月份第一次尝试了赎回，并且在12月开始了赎回套利。
全年靠这个套利增加了大约12万人民币和1.5万美元的利润，折算成人民币一共约22万收益。这点小钱虽然比不上<?php EchoXueqiuId('2950181900', '没钱老板'); ?>赚得多，但是多半比一直坚持学习巴菲特持股不动的<?php EchoXueqiuId('6900406005', '大熊宝宝--林某人'); ?>收益好。
<br />跟自己比较也有找到了圣杯的感觉，一年买卖总交易额1100万美元的套利总算跑赢了从2年前一开始就持股不动。
<br /><img src=../photo/20180101.jpg alt="Screen shot of woody's 2017 XOP and SZ162411 arbitrage data" />
<br />申购套利要从华宝官网场外转场内，其中要用到深圳席位号：
</p>
<ul>
  <li>广发 236300</li>
  <li>华泰 233200</li>
</ul>
<p>在开始搞申购和赎回后，由于漫长的人民币等待周期，美元一下子显得多了出来，不甘寂寞的我在9月份尝试了SINA和<?php EchoMyStockLink('WB'); ?>的套利，在我的均线亏钱大法下很快演变成了一场裸空SINA的噩梦。
冷眼旁观的zzzzv嘲笑我说：见过空WB多SINA的，也见过空SINA多WB的，裸空WB的也有，就是没见过裸空SINA的！最后我空的SINA在一个半月后终于不赔钱退出，再不敢自作聪明了。
<br />而空标普500的噩梦则持续了一整年，贡献了我今年所有的亏损。本来想在昨天最后一个交易日彻底清空止损的，但是没有下手，主要还是不知道止损后多出来的十多万美元拿来干什么好。想想当初夸下了海口，出去的美元就没有打算再回来，总不能现在打自己的耳光换成人民币吧！ 
<br />2017年只剩下明天最后一天，让我最满意的是，忍住今晚不吃，看样子今年能成功避免痛风发作。得意之余，年终总结的题目便从<a href="#2016">2016</a>年的<font color=teal>留得青山在 不怕没柴烧</font>改成了<font color=teal>采菊东篱下 悠然见南山</font>。
2018年继续大隐隐于市的隐居生活，早日止损空标普，继续套利的圣杯，争取净赚个10%回来，有望首次结束多年来坐吃山空的窘境。 
</p>

<h3>行至水穷处 坐看云起时 - <a name="2018">2018</a>总结</h3>
<p>2019年1月1日
<br /><img src=../photo/stockscreens.jpg alt="Woody's 2018 stock trading computer screens" />
<br />3台电脑，全年每天A股4小时加美股6.5小时的全职交易，光在盈透上的买入和卖出总金额就都分别超过了1000万美元。结果2018最终以亏近1万人民币结束。
<br />延续<a href="#2016">2016</a>和<a href="#2017">2017</a>每年一个的打新运气，2018年继续中了一个新股<?php EchoMyStockLink('SZ300748'); ?>。不过收益大为缩水，不到1万块。
<br />在美股中石化价格高于A股价格时空SNP多SH600028的交易策略一共出现了3次交易机会，陆续加起来赚了几千块。结果年底时一贯认为最安全的打新门票SH600028踩到雷，2万股持仓2天一下子跌去一万多，全年下来在中石化上总体倒还亏钱了。
<br />亏钱的东西当然远不止中石化。6月下旬上证跌破2900后我巴菲特附体开始抄底沪深300，A股市场买<?php EchoMyStockLink('SH510300'); ?>，美股市场买<?php EchoMyStockLink('ASHR'); ?>。一路抄底下来，加起来已经有60多万人民币的持仓，亏掉了快5万的本钱。
原本想象中的SH510300和ASHR跨市场套利则几乎没有什么收获，估计炒ASHR的都是跟A50期货套利老韭菜，面对这样的对手盘是没赚钱机会的。
<br />倒是采用天灵盖均线大法实现沪深300增强的操作总时不时有赚钱机会。除了SH600028外，其它的几个门票SZ000069、<?php EchoMyStockLink('SH600104'); ?>、SH600377和SH600600都或多或少赚了点钱，多少弥补了一些沪深300的损失。
A股同涨同跌的特点多少年都没有变过，不过我想随着市场上的中外大型联合收割机越来越多，这种割韭菜的好日子以后也不会太长久了。
<br />当初让我有信心走向职业炒股的圣杯：华宝油气和XOP的跨市场套利，在这一年中总体亏了2万人民币。年初时对圣杯期待过高，持有了过多的华宝油气的同时空了过多的XOP，结果在XOP第一次冲向45美元的过程中我的IB账户就爆仓了。
我之前经常嘲笑只用一个手机屏幕炒股的<?php EchoXueqiuId('1620894332', '杭州大空头'); ?>没搞明白赌场规则就下场了，在我亲历爆仓后才发现自己是五十步笑一百步，其实我也没搞清楚盈透的保证金规则！
<br />因为不了解赌场规则亏钱的事情还出现了一次。2月5日盘后VIX恐慌指数暴涨100%，让过去几年一直稳定赚钱的空VIX基金瞬间爆仓。当我看到<?php EchoMyStockLink('SVXY'); ?>盘后价格从70多直落到18时，完全没有意识到是爆仓，还以为是市场对第二天过度恐慌了。
依我长期空美股的失败经验，我用401K账户中仅剩的一点现金咬牙买了100股抄底。第2天清算完后，SVXY直接跌到了12块以下。等到现在年底一看，亏损比例已经超过40%，接近1000美元就这么交了学费。这次教训也进一步加强了我不做盘前盘后交易的决心，一定不能在错误的时间跟错误的对手进行错误的交易！
<br />唯一赚钱的是我的屎SH，全年减亏了大约7000美元，目前还累计亏损接近16000美元。对它回本我已经不做指望，只求割肉减亏。
<br />由于明显的用眼过度，这是视力急剧下降的一年。读了那么多年书一直到硕士毕业都没有近视，而现在我已经在认真考虑去买人生第一副眼镜了。由于前10个月中年度赚钱的天数寥寥无几，我的心态也越来越不好，2017一整年没有发作的痛风终于在8月中旬的时候再次来临，让我再一次感受到了死亡的阴影。
<br />这几年虽然没有赚到钱，但是至少练就了不少少亏钱的本领。展望2019，我还是乐观的。还是延续去年老的期望，靠天灵盖均线大法做跨市场套利赚10%，结束多年来坐吃山空的窘境。
<br /><img src=../photo/20190101.png alt="Screen shot of woody's 2018 stock profit data" />
</p>

<h3>人生如逆旅 我亦是行人 - <a name="2019">2019</a>总结</h3>
<p>2020年1月1日
<br />2019年全年盈利大约10万人民币，收益率大约3%。全仓投入的连续第3年没有达到10%收益率的目标，失败率100%。
<br />其实本来在2月份的时候我已经做到了大约<font color=teal>7%</font>的收益，当时<?php EchoXueqiuId('5956716730', 'ALittlebird'); ?>就劝我刀枪入库马放南山，剩下的10个月买银行理财，就可以历史上第一次完成10%的年度目标了。可惜我没有听如此睿智的建议。
<br />全年总交易金额比2018年下降了大约15%。其实总体交易频率是略增的，但是因为交易策略基本上没有大的变化，XOP的平均价格却比2018年低了一大截，所以导致了总交易金额的下降。 
<br />以下是看图说话的细节，可以跟<a href="#2018">2018</a>年总结对照阅读： 
<br /><img src=../photo/20200101.jpg alt="Screen shot of woody's 2019 stock profit data" />
</p>
<ul>
  <li>@ADRH分组对应2018年的CHU分组。因为2019年取消了A股中国联通跟港股和美股的对照页面，所以挪到了这里。<a href="#2016">2016</a>年初为了抄底油价割肉了CHU，后来一直没有买回来，随着港股一直跌，跌到当年割肉价之下后我又手痒了，开始均线大法逐步买回。 
      后来因为IB美元吃紧，又开了港股通从深股通交易港股联通<?php EchoMyStockLink('00762'); ?>。总体没有减亏多少，不过第一次体验了世界第一贪心的港交所双向印花税。</li>
  <li>@LOTTERY彩票分组加入了2019年新中的2个新股<?php EchoMyStockLink('SH601512'); ?>和<?php EchoMyStockLink('SH688009'); ?>。虽然中彩票的数量比前3年翻倍了，但是收益却最少，2个加起来不到1万块。</li> 
  <li>@MISTAKE分组集中了过去4年的错误操作。2019年割肉了SVXY，略微减亏一点点。下决心再也不碰VIX的衍生品。</li>
  <li>@TICKET门票分组目前只剩下了一年跌了6%的上汽SH600104，其它门票都已经绝尘而去。这也体现了我的天灵盖均线大法的致命弱点，拿不住赚钱的牛股，长期持有的都是赔钱货。不过得益于A股普涨，打新门票分组这一年还是贡献了4万人民币的收益。</li>
  <li>SH510300沪深300分组已经全部清仓。主要是为了腾出人民币做极其占用资金的华宝油气赎回套利。这一年在SH510300和ASHR上的交易一共盈利了快12万人民币，跟2018年底的持仓比，倒是刚好跟上了沪深300指数的涨幅。</li> 
  <li>SH510900分组这一年没有交易。</li>
  <li>SH513500分组目前是我第一重仓，包括600股SPY空单和2900股SH多单，总共做空了26万美元的标普。相比2018年底不到5万美元的SH来说增加了5倍多的仓位。 
      这一年加入<?php EchoMyStockLink('SPY'); ?>空单，主要是不愿意自己手头的SH总被坏人做空吃我的杠杆损耗，也不愿意总给IRS交10%的SH分红税。SH这种东西居然每个季度拿本金定期分红，我只能说美帝太能收割全世界了。标普2019年涨了30%，我这第一重仓亏损了3.1万美元。</li>
  <li>SH518880分组2019年没有交易。</li>
  <li>SNP分组在2019年中石化第2次分红期间从SH600028把仓位都挪到SNP避免分红税后，因为SNP一路下跌就一直没有机会再挪回来，让我深刻体会到了什么叫股市三大幻觉：美股要跌、A股要涨、港股便宜！作为打新门票的一部分，中石化这一年总体贡献了大约2万人民币的利润。</li> 
  <li>SZ162411分组是我交易的主战场。2018年底XOP和华宝油气总持仓接近14万美元。XOP这一年跌了10%，我的仓位随着天灵盖均线大法增加到了目前的25万美元，是第2重仓。得益于持续不断的溢价折价套利交易，2019年这个分组盈利1.7万美元。</li> 
</ul>
<p><font color=gray>You can check out any time you like, but you can never leave. -- California Hotel</font>
</p>

<h3>坐观垂钓者 徒有羡鱼情 - <a name="2020">2020</a>年交易总结</h3>
<p>2021年1月2日
<br />自从使用自己写的<?php EchoNameLink('myportfolio', MY_PORTFOLIO_DISPLAY, '20150818cn.php'); ?>网页统计多个美股和A股账户总体情况以来，按年终美元和港币都转换成人民币的统一方式，
<?php EchoNameLink('2016'); ?>年亏了3万人民币，<?php EchoNameLink('2017'); ?>年赚了16万，<?php EchoNameLink('2018'); ?>年亏了1万，<?php EchoNameLink('2019'); ?>年赚了10万。 
<br />2020年总体折算下来亏了21万人民币。沿用前些年按350万本金计算收益的传统，全年亏损了6%。看似波澜不惊的背后，其实是惊涛骇浪。 
<br />2020年全年基本上都在亏钱状态。3月份最多的时候亏了150万，远远超出了之前2016年最多不到70万的亏损。接下来的反弹中，曾经在6月初减少到只亏不到30万。不过好景不长，到7月底时已经整整亏了70万，8月减亏了几万后，9月底时又整整亏了90万，10月底时亏损则已经超过了100万。
11月奇迹般减亏70多万，然而奇迹并没有在12月延续。 
<br />在2016年油价V型快速反弹的误导下，3月份其实并不是我最恐慌的时候，当时只是小心翼翼的维持着盈透账户美元不爆仓的底线。然而在10月底盈透账户再度面临爆仓的时候，我是真正的束手无策，甚至连像3月份时那样去找人换美元的勇气都没了。还好，上帝终于派来了蓝色小药丸公司的疫苗来救命。 
<br /><img src=../photo/bluelittlepill.jpg alt="Can not find my little blue pill" />
<br />在不断的爆仓阴影笼罩下，2020年的总体交易都是缩手缩脚。全年交易额比2019和2018年都低了不少，盈透交易额已经不到2018年的70%，买卖的美元港币人民币折算总金额已经跌到了不到2亿人民币。 
<br />以下是按<?php EchoNameLink('mystockgroup', STOCK_GROUP_DISPLAY, '20150818cn.php'); ?>看图说话的流水账。 
<br /><img src=../photo/20210102.jpg alt="Screen shot of woody's 2020 stock profit data" />
</p>
<ul>
  <li>@ADRH -1 面对全球疫情，美股和A股都有人救，只有港股没有人搭理。00762全年下跌了37%，我左侧交易在港股通和美股市场都是越跌越买，最终年底总仓位是年初的400%，到了14万人民币，总体多亏损了1万多人民币。</li> 
  <li>@LOTTERY +8 2020年是新股大年，一共中了4个新股。在此彩票分组增加了8万利润。无论是新股个数还是利润都直追前4年的5个新股和9万利润的总和。</li>
  <li>@MISTAKE +2 该分组包括的是前几年美股原油期货ETF和VIX期货ETF等错误交易，在2020年无交易。盈透账户中美元一直濒临爆仓拯救了我，避免了在3月份原油暴跌时再度买入USO，否则后果真是不堪设想。 
      虽然没有交易，但是因为2020年人民币升值，而这个分组之前亏的又都是美元， 最后换算成人民币，少亏了2万！</li>
  <li>@OILPAIR +0 该分组是2020年新建，也许写完这个总结后就会把它合并到@MISTAKE分组中，去跟其中的SINA和WB配对交易为伴了，因为这里包括的也是两个不成功的配对交易。 
      轮动交易<a href="../../res/sz162719cn.php">广发石油</a>和XOP的交易从6月19日持续到了8月14日，然后在9月17到21日又投机搞了一次，整整3个月时间一直过得很充实，只是没有赚到钱。分析了充实而不赚钱的两点原因：一是人民币对美元持续升值，二是对冲不精确。 
      另外一个在华宝油气和XOP的季度调仓时多XOP空<?php EchoMyStockLink('RRC'); ?>的配对交易则是完全踩错了点，不过如果日后还有这种机会，还是可以在踩准点的前提下再来一次的。意识到了自己的错误后把RRC空单平仓了，侥幸没有亏钱。</li> 
  <li>@OILQDII +5 该分组也是2020年新建，我也有写完总结后把它合并到@MISTAKE分组中去跟USO和UWTI为伍的冲动。虽然这个分组在2020年赚了接近5万人民币，但是赚钱的方式却是错误的。而且估计以后也没有类似机会了，预期国内监管层会闷杀全部原油期货QDII基金，跟干掉分级基金一样。 
      说了无数次的大妈救命之恩是双重的，一方面是大妈们勇于场内溢价接盘，另外一方面，场内高溢价吸引了天量的套利资金，让原本流动性不好的原油QDII基金单日规模翻倍，导致基金公司外汇资金跟不上建仓，无意中躲过了3月份原油暴跌最厉害的那几天。</li> 
  <li>@TICKET +3 2020年彩票门票分组只用天灵盖均线大法操作了SH600104和SZ000069，增加了3万人民币利润。持仓金额基本持平。</li>
  <li>SH510300 -0 该分组在2020年只有8笔SH510300的交易和4笔ASHR的交易，虽然在2019年的基础上人民币和美元都各自多赚了一点点，但是总体折算成人民币的收益比2019年反而减少了，这当然是因为人民币大幅升值的原因。</li> 
  <li>SH510900 0 该分组是2016年进行的固定网格交易测试，从2017到2020年都没有再碰过。</li>
  <li>SH513500 +23 该分组从2019年的第一重仓到目前全部清仓，标志着我坚持多年空标普多XOP策略的彻底破产。从此不再当巴菲特的对手盘，让我一下子倍感轻松。在2020年3月9日割肉空标普500的仓位实属无奈，因为当天我的盈透净值跌到了11万美元之下，按规则不能保持4倍杠杆，只能主动平仓把杠杆降到2倍之内。
      事实上，事后有人告诉我盈透的降杠杆不是马上执行的，而10月底到11月初我的盈透净值再次跌到了11万美元之下，的确验证了这个说法，只是不知道到底会宽限多久。2020年SPY上涨了18%，这个分组却减亏了23万人民币，实在是可喜可贺。</li>
  <li>SH518880 0 此时我已经不记得为什么自己会在2016年底到2017年初交易13笔SH518880了，反正从那以后就没有再碰黄金。</li> 
  <li>SNP -4 该分组情况跟前面@ADRH类似，00386在2020年下跌了19%，我勇敢的越跌越买，此刻仓位是一年前300%，持仓已经折合53万人民，是第2重仓。全年亏了折合4万人民币。</li> 
  <li>SZ160416 +3 该分组也是2020年新建，包括2部分交易。一部分是1月初伊朗将军被杀，导致<a href="../../res/sz160416cn.php">石油基金</a>连续两天场内份额翻倍，我手痒之下尝试了它跟<?php EchoMyStockLink('IXC'); ?>的跨市场套利，后因为套利者互相踩踏和对冲不精确，很难受的不亏钱退出了。 
      另外一部分是开始于9月份绝望的不要怂就是干抄底，用错误的方法贡献了3万人民币的利润。</li>
  <li>SZ162411 -63 这里是我的主战场。XOP在2020年下跌了36%，我在这一年中美元人民币总共亏了折合63万人民币。表面上看总持仓从一年前的172万人民币降到了如今的155万，其实是拼死加仓了46万。 
      华宝油气这一年不是连续溢价就是连续折价，把十多万账户的套利者忙了个团团转。每天都觉得自己在赚钱的感觉的确特别好，除了在年末算总账的时候。</li>
  <li>SZ162719 +2 该分组也是2020年新建，幸好我换了个新的大屏幕一体机，不然在小笔记本上完整的把持仓盈利截图都难。
      主要交易是在9月份跟SZ160416一起绝望抄底，然后没多久又怂了，改为用<?php EchoMyStockLink('IEO'); ?>精准对冲后， 一直做折价赎回套利延续至今。贡献了接近2万人民币的利润。</li> 
</ul>
<p>疫情终会过去，也许2020年多亏点并不是坏处，这样2021年我就有更有希望首次完成年度盈利10%的目标了。 2021年将是背水一战，再赚不到钱，真的就只能去找工作。因此标题用的是自荐求工作的两句诗。 
<br /><font color=gray>歌女的歌、舞者的舞、剑客的剑、文人的笔、英雄的斗志，只要是不死，就不能放弃。 -- 英雄无泪</font>
</p>

<h3>明知山有虎 偏向虎山行 - <a name="2021">2021</a>年交易总结</h3>
<p>2022年1月1日
<br />雪球达人秀在2020年7月发<?php EchoExternalLink('https://xueqiu.com/1876906471/152959448', '关于我的文章'); ?>时有人留言说，居然没有在最后看到剧情反转。时隔一年半后，反转终于还是来了。
<br /><img src=../photo/matchpointluck.jpg alt="People are afraid to face how great a part of life is dependent on luck" />
<br />从<a href="#2016">2016</a>年到<a href="#2020">2020</a>年，我自己写网页统计的累计盈利是2万人民币。如今终于在2021年赚到了人生的第一个100万股票收入，全年盈利112万。按350万本金的惯例计算年收益率为32%，按6年115万算则年化收益率为5%。
在2020年累计亏损最多的时候是150万，而在2021年中6年累计盈利的峰值是130万。以下是2021年按字母排序的各个分组情况流水账：
<br /><img src=../photo/20220101.jpg alt="Screen shot of woody's 2021 stock profit data" />
</p>
<ul>
  <li>@BABAJD分组为新建。在中丐基金统一年度调仓前一天收盘时做多<?php EchoMyStockLink('BABA'); ?>做空JD，在调仓当天收盘时分别平仓。赌的是BABA这一年跌幅巨大，按指数规则各个中丐基金都需要在调仓日补仓它。
      事实上可能因为BABA市值相对于中丐基金们来说过于庞大，这个效应并不明显。25000美元的赌注侥幸赚了几十美元，完全不知道靠的是运气还是实力。</li>
  <li>@CHU分组由2020年的@ADRH分组改名而来，原意是在H股和它的美股ADR之间配对交易，不过今年CHU被摘牌了，就变成了用<?php EchoExternalLink('https://xueqiu.com/2244868365/115712836', '天灵盖均线大法'); ?>交易00762的独角戏。
      一年下来按港币算多亏了800，得益于人民币升值，按人民币算反而减亏了几十块。00762全年下跌5%，因此可以看成均线大法的额外收益大约年化5%。低收益不说，还要承受港交所调高印花税，每天看交割单都被收港股通组合费等心理折磨，等回本后再也不打算交易它了。</li>
  <li>@Gamestonk分组也是新建，也是一个调仓套利。GME在1季度涨了10倍后，等权重的<?php EchoMyStockLink('XRT'); ?>需要在1季度调仓时卖掉90%以上的GME持仓。于是我在调仓前一天收盘时空GME多XRT，然后在调仓当天收盘时跟XRT基金一起平仓。</li>
  <li>@HSCEKWEB分组为新建，是在跨市场套利交易SZ164906手头缺货时用SH510900替代的假对冲。做多KWEB的几小时后卖出SH510900，赌的是KWEB不会长期低于40美元。2022年要加大SZ164906的对冲持仓，避免再搞这种自欺欺人的交易。</li>
  <li>@LOTTERY是记录新股中奖的老分组，跟前面几个分组不痛不痒没亏钱也没赚什么钱不同，2021年中了史上最多的6个新股，真金白银的多赚了12万人民币，也是史上最多。可惜如今新股破发太多，怕被罚款的我已经只敢在主板申购，这样的盈利2022年显然已经不可持续。</li>
  <li>@MISTAKE是全年无交易的老分组，说明没有继续犯老错误。因为人民币升值，一年下来倒是减亏了几千人民币。</li>
  <li>@OILPAIR则是合并了2020年的@OILPAIR、SZ160416和SZ162719三个分组，事实上2021年新交易仅限于全对冲IEO下的SZ162719赎回套利，增加了大约5000人民币的盈利，随着SZ162719的流动性迅速消失而结束。合并的好处之一是更容易计算这几年在原油上的总盈利，同时也表达一种不打算继续把原油做下去的态度。</li>
  <li>@OILQDII全年无新交易。</li>
  <li>@TICKET是打新股的门票老分组，全年只继续用均线大法交易了SH600104和SZ000069。总体增加了1万多人民币的利润。目前已经没有SZ000069的持仓，而SH600104其实也可以考虑撕票了。</li>
  <li>HSCE分组由老的SH510900分组改造而来。在2021年1月跨过香江去的一次SZ160717申购套利中，有一笔没有及时止损几十块钱卖出。伴随着港股的持续下跌，我习惯性的在SZ160717分组中施展均线大法抄底，一直到11月的一天发现它场内溢价1%，跌不到要买的均线价格。
      我于是灵机一动卖出了全部<a href="../../res/sz160717cn.php">SZ160717</a>持仓，买入了几乎平价的SH510900。随后把这两个国企指数基金的交易合并在了一起，继续在<a href="../../res/sh510900cn.php">SH510900</a>上施展均线大法。全年下来一共亏了6000多人民币，不止损的结果就是把亏损扩大了2个数量级。</li>
  <li>SH510300分组全年无新交易。A股又继续了一年牛市，沪深300实在觉得贵得下不去手。</li>
  <li>SH513500是做空标普500的老分组，本来在2020年发誓赌咒不再干空标普500多XOP的假对冲了，2021年XOP暴涨后还是没有管住自己的手，又重新下场累计空了300股SPY，全年多亏了10万人民币。这也是2021年题目用一首暴露年龄的老歌歌词，叫明知山有虎偏向虎山行的原因。</li>
  <li>SH518880无新交易。</li>
  <li>SNP分组继续了美股SNP和港股00386的混合均线交易。00386全年上涨了14%，这个分组盈利了8万多，大约17%的收益，再一次显示出了均线大法在赚钱上的低效率，完全就是为了治手痒图个乐。还是那句话，要找机会全面退出恶心人的港股交易才明智。</li>
  <li>SZ162411分组还是一如既往的主战场。XOP和SZ162411跨市场套利叠加均线大法做T，全年盈利大约96万。XOP全年上涨了67%，收益大约62%，主要是因为在XOP上涨的过程中为<?php EchoExternalLink('https://xueqiu.com/2244868365/144000143', '防爆仓'); ?>减仓了部分仓位，虽然现在看是过虑的。
      事实上，在XOP年初50日EMA上穿200日EMA确认牛市后，应该加仓而不是减仓。SZ162411、SNP、@OILQDII和@OILPAIR四个分组六年累计105万的收益，体现了这几年抄底原油的辛酸历程。如今别说SZ162719，就连SZ162411的场内流动性都已经日益枯竭。下一个100万在哪里？</li>
  <li>新建的SZ164906分组是我下一个100万的期望。虽然这个分组在2021年只盈利了3万多人民币，但是对我来说却是一个飞跃。我在这里开始了第一次止损操作，继而靠不断止损坚持下来了全年的KWEB和SZ164906全对冲套利交易。
      如果在未来<?php EchoMyStockLink('KWEB'); ?>的50日EMA上穿200日EMA按美股标准进入牛市后能够像止损一样克服心理不适进行右侧交易追涨，我就能跟天灵盖均线大法说再见了！</li>
</ul>
<p><font color=gray>平生勇猛岂会轻就范 -- 《再向虎山行》主题曲</font>
</p>

<?php
function _groupUnchanged($strGroupName)
{
	return GetQuoteElement($strGroupName.'分组无变化。');
}

function Echo20221231($strHead)
{
	$str2016 = GetNameLink('2016');
	$str2021 = GetNameLink('2021');
	$strImage = GetWoodyImgQuote('20221231.jpg', '2022年最终持仓盈利107万人民币');
	$strSZ159612 = GetGroupStockLink('SZ159612');
	$strSZ161127 = GetGroupStockLink('SZ161127');
	$strChinaInternet = GetStockCategoryLink('chinainternet');
	
	$strHead = GetHeadElement($strHead);
	$strList = GetListElement(array('@CHU分组赚了快3万人民币，00762年度34%的上涨让我终于在中国联通上回本了。然而我并没有像上年度总结中计划的那样清仓，而是给自己找了个借口，想接下来看看个股牛市下的天灵盖均线大法的交易情况。',
								  '@Gamestonk分组合并了上年度的@BABAJD和@HSCEKWEB分组，更早的SINA/WB配对交易也从@MISTAKE分组挪到了这里。本年度其实没有新增任何调仓套利或者其它异想天开的配对交易。',
								  '@HSCE分组由上年度的HSCE分组改名，赚了1万多人民币。主要靠在布林下轨不懈抄底，SH501900和SZ160717的几次轮动也略有帮助。',
								  _groupUnchanged('@LOTTERY').'一个新股都没中。主要是怕彩票变罚单，没敢继续参与时常破发的科创板申购。',
								  '@OILPAIR分组多了20多笔XLE和SZ163208的套利，贡献了不到2000人民币的利润。估值不准的套利交易太痛苦了，以后不能再搞。',
								  '@OILQDII分组多了若干笔SZ160216、USO和美油期货CL的套利，以及4笔GSG和SZ161815的套利，同样因为估值不准吃够了苦头，最终也没赚到什么钱。另外把以前USO和UWTI的亏钱交易从@MISTAKE分组挪了过来，所以看上去这个分组本年度亏了不少，其实倒也没有。',
								  '@SNP分组由上年度的SNP分组改名，赚了约9万人民币。SNP本年度在美股摘牌，这个分组变成了跟@CHU一样的港股独角戏。00386年度上涨了20%，赚到的钱基本上跟上了这个涨幅。',
								  '@TICKET亏掉了14万人民币，重仓的门票SH600104年度跌了27%，本该撕票却还加了仓。中间还在布林下轨抄底了几次深市门票SZ000069，直到有天我突然觉得不能碰任何跟房地产沾边的公司了。',
								  '@VIX分组就是去掉了SINA/WB和USO/UWTI交易后的老@MISTAKE分组，因为现在它里面只剩VIX相关的错误交易了，本年度实际无变化。',
								  'SH510300分组赚了1万人民币左右，也是得益于几次布林下轨的勇敢抄底。沪深300年度跌了20%，火中取栗。',
								  'SH513500分组大赚了25万人民币，因为标普500年度跌了19%，多年来空标普多油的自欺欺人策略终于兑现了回报。',
								  _groupUnchanged('SH518880'),
								  $strSZ159612.'分组为新增，十多笔SZ159612和标普500期货ES的套利贡献了大约7000人民币的利润。这种实时交易要靠自动交易才行，手动操作太痛苦。另外美股股指期货的升水贴水也很容易照成套利误判，也许并不是个好的赚钱方式。',
								  $strSZ161127.'分组也是新增，靠SZ161127和XBI的套利赚了14000人民币。这个估值准确，可惜关门了，易方达公司的QDII资金都被'.$strChinaInternet.'占了。后期只能靠XBI大涨SZ161127折价时囤货，以后可以继续小打小闹玩。',
								  'SZ162411分组依旧是主战场，贡献了67万盈利。XOP年度上涨45%，获利跟中石化一样也是基本上跟上了涨幅。这两年盈利的根本原因都是做多了老能源，这种情况下一年无论如何不会持续下去了。',
								  'SZ164906分组上年度寄予了厚望，不过本年度只赚了14万。依旧还是指望它在2023年赚到人生中炒股的第3个100万，毕竟它已经是QDII市场上流动性最好的LOF基金。',
								  ), false);
	$strQuote = GetBlockquoteElement('因过竹院逢僧话，偷得浮生半日闲。');
	
    echo <<<END
	$strHead
<p>2022年12月31日
<br />本年度持仓盈利107万人民币，按450万本金计算年化收益率24%。从{$str2016}至今7年总盈利222万，按350万本金计算年化收益率7%。2022年的收益无论从绝对值还是比例上都没有{$str2021}年多，即使如此，我还是时不时的陷入如何有效区分运气和能力之中，标题反应的就是这种侥幸的心情。
写点东西下来无疑会有助于思考，以下是2022年按字母排序的各个分组情况流水账：
$strImage
</p>
	$strList
	$strQuote
END;
}

function Echo20231231($strHead)
{
	$str2016 = GetNameLink('2016');
	$str2021 = GetNameLink('2021');
	$str2022 = GetNameLink('2022');
	$str2018 = GetNameLink('2018');
	$strPalmmicro = GetBlogLink(20080326);
	$strImage = GetWoodyImgQuote('20231231.jpg', '2023年最终持仓盈利9万人民币');
	$strTLT = GetMyStockLink('TLT');
	$strTractor = GetAutoTractorLink();
	$strFundAccount = GetFundAccountLink('SZ161126', 28020);
	
	$strHead = GetHeadElement($strHead);
	$strList = GetListElement(array('@CHU分组赚了1万多人民币。00762年度上涨8%，却重新跌回了熊市，这给了我一个好理由在最后一天把它清仓了。事实上，我决定以后不再直接交易港股，实在受够了一年收365天的港股通组合费和坑人的分红税。',
								  '@Gamestonk分组加入了无处安放的'.$strTLT.'交易，实在不知道新增加个什么分组好，就是跟着雪球群众凑了凑热闹赚了1000多美元。美元20年国债收益率从4%到5%涨一个百分点，它能跌20%，坐了一圈过山车后，想想早已经下决心不做跟踪期货的ETF，也许跟踪国债的ETF一样也是散户的坑。'
								  	.'另外，因为想通了需要右侧交易的期货和天灵盖均线大法的天然不匹配，我删除了需要国内期货对冲交易的黄金白银基金估值页面，把几年未动的SH518880的交易也挪到了这个专业垃圾分组。',
								  '@HSCE分组上半年轮动了几次SH501900和SZ160717，后来510900开始一跌就溢价，让我只能在布林下轨附近申购160717了。国企指数年度跌了14%，这个分组倒还赚了接近1000人民币。',
								  _groupUnchanged('@LOTTERY/@OILPAIR/@OILQDII'),
								  '@SNP分组赚了约7万人民币。00386年度上涨了17%，也是却重回熊市，同样在最后一天清仓，不再亲手给露天纸糊的港交所贡献印花税了。',
								  '@TICKET分组成了SH600104的独角戏。上汽年度跌了4%，一度反弹回牛市后又迅速被打压回去。一年交易了95次，总体增持了2000股，亏了快2万块。',
								  _groupUnchanged('@VIX'),
								  'SH510300分组居然只亏了不到1块钱，沪深300年度可是跌了10%。',
								  'SZ159612分组合并了上年度的SH513500分组，主要是为了合并ES的交易，用这种方式下决心不再进行任何期货交易。SPY年度涨了26%，这里一共亏了15万人民币。',
								  'SZ161126分组纯粹只是为了测试一下久未使用的'.$strTractor.'，本来是抱着亏钱就当软件测试成本的心态，没想到赚了易方达为避免清盘而发的50块广告宣传费。每个账户限购300，开放申购首日有'.$strFundAccount.'户申购。'
								  	.'QDII基金市场火爆，基金公司现在都只发ETF了，挽救一个LOF也是为了挽救自己岌岌可危的跨市场套利圣杯。',
								  _groupUnchanged('SZ161127'),
								  'SZ162411分组贡献了11万人民币盈利。我多少有点害怕盈亏同源的噩梦，在XOP进熊市后清仓，感觉心理上轻松了很多，没想到它又轻松回到牛市，年度上涨4%。',
								  'SZ164906分组在过去两年一直被寄予厚望，不过本年度还是只赚了6万。KWEB年度跌了9%，漫漫熊途。',
								  ), false);
	$strQuote = GetBlockquoteElement('白马已经老了，只能慢慢的走。--- 《白马啸西风》');

    echo <<<END
	$strHead
<p>2023年12月31日
<br />本年度持仓盈利9万人民币，按500万本金计算年化收益率2%。从{$str2016}至今8年总盈利232万，按350万本金计算年化收益率7%。
<br />在{$str2022}年和{$str2021}年各赚了100万后，好运气结束了，回到了之前兜兜转转不赚钱的状态。不过感觉自己总体心态从容了很多，47岁是男人最低谷，到50岁就彻底绝望了。
事实上，这几年一直在做减法，告诫自己这也不该做那也不该做。体现在有数据可查的盈透交易额上，本年度买卖加起来已经只有1千万美元，只有{$str2018}年的一半。在11月的时候，我好几次在雪球上绝望的呐喊过去24小时0交易，全职交易都把自己干失业了！
<br />是的，在主动抵制隐藏在套利党内部的举报者一年后，我在2月份{$strPalmmicro}网站因为被动迁徙Amazon云而崩溃后重新又开始上雪球了。主要是觉得还是要有一个渠道跟人打交道，而当初为不上雪球节省下来时间而计划做的事情，一件都没有做成。
<br />以下是2023年按字母排序的各个分组情况流水账：
$strImage
</p>
	$strList
	$strQuote
END;
}

function Echo20250101($strHead)
{
	$strHead = GetHeadElement($strHead);
	$strTitleImage = ImgAutoQuote(PATH_BLOG_PHOTO.'20250101cover.jpg', '愁边动寒角，夜久意难平。');
	$str2016 = GetNameLink('2016');
	$str2023 = GetNameLink('2023');
	$strUsdInterest = GetBlogLink(20230614);
	$strFuturesPremium = GetBlogLink(20200424);
	$strXueqiu = GetXueqiuIdLink('2747564710', '磨刀霍霍向猪羊01');
	$strImage = ImgAutoQuote(PATH_BLOG_PHOTO.'20250101.jpg', '2024年最终持仓亏损24万人民币');
	
	$strUSDCNH = GetMyStockLink('fx_susdcnh', 'USDCNH');
	$strList = GetListElement(array('@Gamestonk分组合并了2023年底清仓的@CHU分组，然后增加了几十条本年的TLT交易，总体上差不多亏了1万人民币。TLT在2024年下跌了8%，雪球上因为美元降息而做多它亏钱的人应该很多。',
								  '@HSCE分组赚了不到5000人民币，4月底时在布林上轨赎回SZ160717后相当于卖飞了, 最终它全年涨了30%，拍断大腿。不过它的流动性实在太差了，申购赎回的灵活性也不好，以后打算彻底放弃了。',
								  '@LOTTERY分组原来是记录打新的，2024年11月开始我终于说服自己开始对冲汇率，把'.$strUSDCNH.'的交易放在了好几年都没有更新的这里，亏了接近2万人民币。',
								  '@OILPAIR分组基本上没有交易，主要是把2023年底清仓的@SNP分组合并进来了，看上去似乎赚了好多。回过头看，2023年底因为不满港交所而清仓港股中石化和联通真是跟自己的钱过不去。',
								  _groupUnchanged('@OILQDII'),
								  '@TICKET分组依旧是SH600104的独角戏，上汽这一年涨了58%，我赚了23万。',
								  _groupUnchanged('@VIX'),
								  'SH501225分组是新增，记录的上半年一场极其纠结的不完全对冲套利。虽然最终侥幸赚了2000人民币，但是下定决心从此真的不再做估值不准的对冲套利了，显然我以前也曾经下过这种决心。',
								  'SH510300分组在布林下轨捡了好多次死鱼后终于在9月底时全部卖飞了，赚了2万多。后来想通了活鱼也应该掏钱买，却始终下不去手。',
								  'SZ159612分组全年亏了71万人民币，SPY年度涨了25%，年初两倍杠杆空标普500到年底变成了四倍杠杆。进入11月后盈透几乎每天都会收我的overnight position fee, 就像2023年的港股通组合费一样，我很容易被这种每天持续的小额收费搞崩溃，终于在12月下旬抗不住了开始割肉空单到三倍多一点的杠杆避免这个费用，不割肉的话今年还能少亏一些。',
								  'SZ161116分组是新增，主要是测试一下拖拉机自动化软件，赚了几十块钱算意外之财。',
								  'SZ161125分组也是新增，限购100我都是参与的，限购300刚开始没敢参与，总觉得会被砸折价，后来想通了，手持500万人民币标普500空单，做多1800块有啥好担心的。最终套到易方达关门，赚了接近1000块人民币。',
								  'SZ161126分组在12月份易方达关门前，八个限购100的品种八仙过海搞了三天，侥幸没亏钱。',
								  'SZ161127分组在搞八仙过海过程中就亏钱了，还好东方不亮西方亮，总体上算八仙没亏钱。',
								  'SZ161128分组是新增，限购300的始终没敢参与，只搞了限购100的，总共赚了接近4000块。',
								  'SZ161130分组也是新增，在它难得的场内折价时跟NQ期货做了一次对冲套利，其它都是限购100申购赚的，2000多人民币聊胜于无。',
								  'SZ162411分组跟前些年比交易少了很多，主要靠屠龙之技赚了5万人民币。限购100的降仓位保申购游戏目前依旧在持续，看这一次华宝基金会把它仓位降到多少时结束游戏。',
								  'SZ162415分组是新增，华宝基金跟SZ162411一起搞限购100的申购，目前已经赚了快100块。',
								  'SZ164824分组也是新增，这是2024年最让人省心的限购100申购套利，每天闭着眼睛申购闭着眼睛卖，赚了接近4000块。虽然最近两轮都让我亏钱了，但是依旧在幻想好日子还会回来。',
								  'SZ164906分组依旧是抱着最大的期望，做着最多的交易，浩浩荡荡一千多条的交易记录，全年赚了18万人民币。SZ164906全年上涨14%，KWEB全年上涨12%，离方丈说的东升西降还有距离，依旧还是希望能在这个分组赚到第三个一百万。',
								  ), false);

    echo <<<END
	$strHead
<p>2025年1月1日
$strTitleImage
<br />本年度持仓亏损24万人民币，按450万本金计算年化收益率负5%，从{$str2016}年至今九年总盈利207万，按350万本金计算年化收益率5%。这是极其抑郁的一年，印象中似乎一天都没有年度盈利过，最大年度亏损在9月份时达到了接近70万，最终收窄到顺口溜般的24年亏24万，也是创下来九年来最高的年度亏损金额。
<br />{$str2023}年交易总结中曾经信誓旦旦的写不再交易期货，没几个月年初在盈透账户中两倍杠杆空的SPY就变成了三倍杠杆维持不下去了，只好从做空吃利息亏本金改为做空期货吃升水亏本金，狠狠打了自己一耳光。
之前写过{$strFuturesPremium}和{$strUsdInterest}的关系，具体交易时发现每时每刻的升水除利息外的波动也不小，这促使我终于动手做了件喊了很多年的事情，用盈透提供的API自动测算标普500期货的短时间升水同时调整买卖价格自动交易。
<br />促使我在2024年开始使用盈透API的更重要的因素是美股开始了夜盘交易，这彻底动摇了我当初敢于全职炒股的圣杯：华宝油气和XOP的跨市场套利。随着XOP开始了全天24小时（少10分钟）的交易，原来的各种交易逻辑都面临重塑。
为了挽救屠龙之技，我开始使用盈透API的夜盘数据写了一个新工具，用来实时计算华宝油气和XOP在A股交易时间段的交易折价溢价。受限制于盈透数据的付费非专业使用者协议，我不能像palmmicro估值网页那样提供给大家自由使用，不过我还是同样把所有盈透API的代码都一起公开放在了github上。
<br />Github在2024年也让我很郁闷，{$strXueqiu}在autoit拖拉机自动化软件上增加了场外申购和场外转场内的功能后，我发现已经登录不上github去合并代码。原因是几年前它开始二次验证的时候，我自作聪明跟着网上一篇文章修改了它的动态网页代码，加入了+86开头的中国号码进行二次验证，现在彻底收不到验证码了。
更糟糕的是，折腾了一圈网页登录失败后，我原本不需要二次验证的日常check in等功能也登不上去了，最后被迫放弃了它上面的palmmicro的名字，自己从原来代码中fork了一个分支，然后继续在这个新分支中更新代码。
<br />吐槽一旦开始就难结束，我最好还是停下来，开始写一下具体交易情况的流水账：
$strImage
</p>
	$strList
END;
}

function Echo20260101($strHead)
{
	$strHead = GetHeadElement($strHead);
	$strTitleImage = ImgAutoQuote(PATH_BLOG_PHOTO.'10years.jpg', '桃李春风一杯酒，江湖夜雨十年灯。');
	$str2016 = GetNameLink('2016');
	$strXueqiu = GetXueqiuIdLink('1865006408', '公子是长安');
	$strImage = ImgAutoQuote(PATH_BLOG_PHOTO.'20260101.jpg', '2025年最终持仓亏损40万人民币');
	
	$str2024 = GetNameLink('2024');
	$strXLV = GetMyStockLink('XLV');
	$strRSPH = GetMyStockLink('RSPH');
	$strSZ161226 = GetGroupStockLink('SZ161226', true);
	$strList = GetListElement(array('@Gamestonk分组现在成了垃圾回收站。除了依旧新记录本年的47条TLT交易总共赚了七百美元外，合并了'.$str2024.'年不完全对冲套利的SH501225分组，以及上一年开了几次拖拉机后本年度用错误的方式极其煎熬地盈利了接近四千人民币的SZ161126分组，又一年发誓赌咒再也不做估值不准的套利了。为了方便写年度总结，通常我不会在新增交易的同一年合并分组，这次破例是因为要把SZ161126从'.$strXLV.'改用'.$strRSPH.'准确估值。',
								  _groupUnchanged('@HSCE'),
								  '@LOTTERY分组的对冲汇率操作在九月因为美元严重吃紧结束了。接近一年的汇率对冲总体亏了一部分，在盈透账户里最终留了不到一千美元的离岸人民币无法凑整换回美元，所以成了现在持仓的样子。具体到2025年，倒是赚了一万多人民币。',
								  '@OIL分组合并了之前的@OILPAIR和@OILQDII，这样截图可以紧凑一点，实际上没有新增交易。',
								  '@TICKET分组依旧是SH600104的独角戏。上汽这一年跌了26%，交易了148笔，亏了十万人民币。',
								  _groupUnchanged('@VIX'),
								  'SH501018、SZ160723和SZ161129分组都是新增。主要是国庆后改为按季报持仓给这三个原油LOF估值后自己吃了几次螃蟹，可喜的是原油熊市，一直是赚美元亏人民币，多出来快三千美元帮忙减轻了一点点盈透账户的美元压力。其余的是五月份发誓赌咒将军赶路不追小兔之前在SZ160723和SZ161129上开了几次拖拉机，后面会说到这个发誓赌咒又可耻的破产了。总体赚了不到五千人民币。',
								  'SH510300分组五月之前在布林下轨继续捡了几次死鱼后卖飞，后来我发现寒武纪混进了指数，连死鱼都不再敢去捡了。总体赚了不到两千人民币，错过了沪深300年度21%涨幅的大牛市。',
								  'SZ159612分组全年亏了九万美元，前两年一直在念叨第三个一百万从哪里来，没想到这里先累计亏掉了第一个一百万。SPY年度涨了18%，盈透空标普500杠杆上升到了八倍，2024年觉得不能忍受的overnight position fee早已经成了常态，明年标普500再涨5%就面临全面破产。盈透美元极度吃紧也严重影响了我其它的跨市场套利操作。一直在后悔没有在四月暴跌的时候平仓离场，总是想到上帝会说，我已经派船去救过你了。',
								  'SZ160416分组是新增。本着测试拖拉机自动化软件的精神在四月下旬申购了两次，每天集合竞价跌停价砸盘卖导致亏了快三块人民币。',
								  'SZ160719和SZ164701分组都是新增。连同去年新增做了几笔拖拉机的SZ161116分组，共同点是四月又开了一轮拖拉机，然后八月把这三个黄金LOF改为按季报持仓后自己吃了几次螃蟹，总体折算汇率后赚了一千人民币。赶上了在黄金白银上升期空GLD和SLV，美元部分亏了一千多，郁闷无比。',
								  'SZ161124分组是新增的拖拉机小兔，实在是乏善可陈。预计下一年年度总结前会被挪到最上面的垃圾回收站去。',
								  'SZ161125分组在五月份之前开了一段拖拉机，同时因为测试企业微信调试和平仓数据软件一直在做跟SPY的跨市场折价套利，总体赚了快三万人民币，不过美元部分也是比较郁闷的亏了快三千美元。',
								  'SZ161127分组也是在五月份之前开拖拉机，同时调试软件数据有机会就做跟XBI的跨市场折价套利，总体赚了一千多人民币。',
								  'SZ161128分组开了一次拖拉机，典型的垃圾交易。',
								  'SZ161130分组也是在五月份之前开拖拉机，同时有机会就做跟QQQ或者TQQQ的跨市场折价套利，总体赚了不到三千人民币，做空的美股部分一直涨，美元部分又亏了快一千美元。',
								  'SZ161226分组是新增，就连'.$strSZ161226.'估值页面都是国庆期间恢复的，套利夜空中最亮的星就是它了。我因为深知自己的赌性一直没敢开国内期货账户，因此没能参与SZ161226的对冲套利。同时因为几个月前的发誓赌咒，也一直没有参与开拖拉机，直到12月24日看到限购500块的砸盘下溢价超过了60%，小兔都变成野猪了，才自己打脸开始场内申购。',
								  'SZ162411分组继续靠五月份之前的拖拉机和跨市场套利的屠龙之技赚了四万人民币。跟三个原油LOF一样，这是原油熊市中赚美元的交易，增加了三千美元。',
								  'SZ162415分组也是在五月份之前开拖拉机，同时有机会就做跟XLY的跨市场折价套利，总体赚了不到三万人民币，但是因为美股大牛市亏了快七千美元。',
								  'SZ164824分组增加了几次拖拉机的小兔垃圾交易。',
								  'SZ164906分组依旧是抱着最大的期望做着最多的交易，全年赚了折合17万人民币，几年下来分组累计盈利到了59万，依旧还是希望能在这个分组赚到第三个一百万。SZ164906全年上涨20%，KWEB全年上涨24%，方丈说的东升西降总算对了一半。',
								  'SZ165513分组是新增。十月的时候把它的估值从GSG改到了按季报持仓的黄金。SZ161226这波套利大潮吸引来了一批没见过申购套利踩踏的新手小白套利党，在申购限额500的SZ161126的同时疯狂申购限额5000的SZ160216和SZ164701以及不限购的SZ165513。拯救套利党的只有套利党，我在如期而至的踩踏中折价对冲进货，目前浮盈折合六千人民币。现在只希望中信保诚基金公司按新规改1%赎回费用的脚步慢一点，等我下个A股交易日赎回平仓后再正式执行。',
								  ), false);
	
    echo <<<END
	$strHead
<p>2026年1月1日
$strTitleImage
<br />从2015年开始在网站记录交易，一晃已经十年。本年度亏了9万美元，赚了25万人民币，总体亏损折合40万人民币，创下了十年最大年度亏损，按350万本金计算年化收益率负11%，{$str2016}年至今十年总盈利168万，按350万本金计算年化收益率4%。
$strImage
</p>
	$strList
<p>上帝关上了门，又开了一扇窗。比股市盈亏更重要的是，因为开发了新的企业微信跨市场套利数据软件，我重新开始写公众号文章，而雪球大V{$strXueqiu}和自媒体达人晓东相继成了我最成功的托，让之前一直赔本赚吆喝的网站把这十年的Yahoo网站服务费用都赚了回来。上一次靠写软件赚钱已经是十多年前的事情，一下子让人生看到了新的希望。
</p>
END;
}

function _getTradingSummary()
{
	static $iYear = 2021;
	
	$iYear ++;
	return ' - '.GetNameTag(strval($iYear)).'年交易总结';
}

	Echo20221231('昨夜三更雨 浮生一日凉'._getTradingSummary());
	Echo20231231('青衫白马慢 似是故人来'._getTradingSummary());
	Echo20250101('愁边动寒角 夜久意难平'._getTradingSummary());
	Echo20260101('套利一杯酒 江湖十年灯'._getTradingSummary());
?>

</div>
                                  
<?php _LayoutBottom(); ?>

</body>
</html>
