<?php
require_once('php/_entertainment.php');

function GetMetaDescription()
{
	return '在美股开始夜盘交易后，提供一个新的软件工具，继续做美股ETF和A股QDII基金之间的跨市场套利。';
}

function EchoAll()
{
	$strSZ162411 = GetBlogLink(20150818);
	$strWechat = GetBlogLink(20161014);
	$strImage = ImgFreeFood();
	$strHady = GetUnderlineElement('Hady');
	$strZhan = GetUnderlineElement('战漏');

	EchoBlogDate();
    echo <<<END
<br />美股从去年开始了OVERNIGHT夜盘交易，每个交易日的盘后交易结束后开始，一直交易到第二天盘前交易的前10分钟结束，完全覆盖了A股的交易时间段，跟踪同一个指数的美股ETF和A股基金不再有交易时间差，给我本就已经是屠龙之技的华宝油气和XOP跨市场套利钉上了最后一块棺材板。
<br />真的勇士，敢于直面惨淡的人生，我于是积极投入到了美股夜盘和A股基金的实时交易之中。十年前促使我写{$strSZ162411}工具的问题再次出现了，在按计算器算了两天实时交易的折价溢价后，我再次削尖铅笔，用上了准备已久的电报机器人，写了本文要介绍新工具。
<br />随着KWEB反弹上了36，来到了分红除权前相当于3年前40美元的位置，当年的长期支撑位变成了现在的阻力位，场内的SZ164906在恐高之下开始持续折价，成了如今跨市场套利的明星。
新工具充分利用了原有网页工具的数据，比如1股KWEB对应215股SZ164916就是按照网页上的建议对冲值，这个数值其实是会跟着仓位和汇率变化的，如果网页对冲值变化了，电报频道@palmmicrochan的数据也会随着变化。
除此之外也有新东西，比如显示的买卖价格和数量是KWEB的买一和SZ164906的卖一数据，理论上按这个消息做交易能即刻成交。另外，即刻成交时显示的价格百分比跟网页上的数据并不是一致的，因为KWEB和SZ164906都存在交易价格和净值不一致的情况。
百分比的计算也没有包括佣金，在折价的情况下，折价大于1%才会发消息提示，而KWEB和SZ164906的佣金都在万分之一的数量级，完全可以忽略。
<br />新工具一开始只在华宝证券开户群内部测试。电报不仅要翻墙，还需要国外手机号短信验证，但是这些麻烦都挡不住套利党，直到有个人跟我说花了200块钱解决了电报使用问题，我开始怀疑自己为了省每年300块的微信认证是不是真的理智。
我在群里问微信小程序能不能免费发推送消息，没想到的是{$strHady}告诉我企业微信群有机器人可以免费广播消息，我马上在我的千元机上安装了企业微信APP，写了20行代码，把电报频道的推送消息复制到了企业微信义工群里。
<br />大家开始更加踊跃测试，有人说直接用微信就能访问企业微信群，有人说要下载企业微信APP才可以。群众智慧是无穷的，{$strZhan}给我截图，告诉我在企业微信管理页面上下载一个微信插件，扫二维码后每个人就都能用微信直接访问企业微信群了。
<br />本来之前发誓赌咒不再写{$strWechat}文章的，写了这个软件后按捺不住，希望自己做的狗食不光是自己吃，又开始提笔宣传了，希望这次不要又被很快举报删除了。
$strImage
</p>                                               
END;
}

require('../../../php/ui/_dispcn.php');
?>
